# running in /TVLSI_WORK/Ginisha/testing_file/check/tb_true_dpram_sclk/check/src/
read -formal /TVLSI_WORK/Ginisha/testing_file/Modules_Design/few_shot_int8_gemma2_9b/true_dual_port_ram_with_a_single_clock_design_6_.v
read -formal /TVLSI_WORK/Ginisha/testing_file/Modules_FV/few_shot_int8_gemma2_9b/true_dual_port_ram_with_a_single_clock_design_6__converted.v
prep -top tb_true_dpram_sclk

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
