# running in /TVLSI_WORK/Ginisha/testing_file/check/tb_mod_demod/check/src/
read -formal /TVLSI_WORK/Ginisha/testing_file/Modules_Design/few_shot_int8_gemma2_9b/modulation_and_demodulation_design_4_.v
read -formal /TVLSI_WORK/Ginisha/testing_file/Modules_FV/few_shot_int8_gemma2_9b/modulation_and_demodulation_design_4__converted.v
prep -top tb_mod_demod

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
