# running in /TVLSI_WORK/Ginisha/testing_file/check/tb_shift_8x64_taps/check/src/
read -formal /TVLSI_WORK/Ginisha/testing_file/Modules_Design/few_shot_int8_gemma2_9b/8x64_shift_register_with_taps.v
read -formal /TVLSI_WORK/Ginisha/testing_file/Modules_FV/few_shot_int8_gemma2_9b/8x64_shift_register_with_taps_converted_converted.v
prep -top tb_shift_8x64_taps

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
