# running in /TVLSI_WORK/Ginisha/testing_file/check/tb_alu_4bit/check/src/
read -formal /TVLSI_WORK/Ginisha/testing_file/Modules_Design/few_shot_int8_gemma2_9b/4_bit_alu.v
read -formal /TVLSI_WORK/Ginisha/testing_file/Modules_FV/few_shot_int8_gemma2_9b/4_bit_alu_converted_converted.v
prep -top tb_alu_4bit

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
