# running in /TVLSI_WORK/Ginisha/testing_file/check/tb_binary_adder_tree/check/src/
read -formal /TVLSI_WORK/Ginisha/testing_file/Modules_Design/few_shot_int8_gemma2_9b/binary_adder_tree.v
read -formal /TVLSI_WORK/Ginisha/testing_file/Modules_FV/few_shot_int8_gemma2_9b/binary_adder_tree_converted.v
prep -top tb_binary_adder_tree

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
