# running in /TVLSI_WORK/Ginisha/testing_file/check/tb_single_port_ram/check/src/
read -formal /TVLSI_WORK/Ginisha/testing_file/Modules_Design/few_shot_int8_gemma2_9b/single_port_ram.v
read -formal /TVLSI_WORK/Ginisha/testing_file/Modules_FV/few_shot_int8_gemma2_9b/single_port_ram_converted.v
prep -top tb_single_port_ram

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
