# running in /TVLSI_WORK/Ginisha/testing_file/check/tb_ram_infer/check/src/
read -formal /TVLSI_WORK/Ginisha/testing_file/Modules_Design/few_shot_int8_gemma2_9b/single_clock_synchronous_ram.v
read -formal /TVLSI_WORK/Ginisha/testing_file/Modules_FV/few_shot_int8_gemma2_9b/single_clock_synchronous_ram_converted.v
prep -top tb_ram_infer

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
