# running in /TVLSI_WORK/Ginisha/testing_file/check/tb_seven_seg_display/check/src/
read -formal /TVLSI_WORK/Ginisha/testing_file/Modules_Design/few_shot_int8_gemma2_9b/7_segment_lcd.v
read -formal /TVLSI_WORK/Ginisha/testing_file/Modules_FV/few_shot_int8_gemma2_9b/7_segment_lcd_converted.v
prep -top tb_seven_seg_display

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
