# running in /TVLSI_WORK/Ginisha/testing_file/check/tb_counter/check/src/
read -formal /TVLSI_WORK/Ginisha/testing_file/Modules_Design/few_shot_int8_gemma2_9b/counter_with_asynchronous_reset.v
read -formal /TVLSI_WORK/Ginisha/testing_file/Modules_FV/few_shot_int8_gemma2_9b/counter_with_asynchronous_reset_converted.v
prep -top tb_counter

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
