# running in /TVLSI_WORK/Ginisha/testing_file/check/tb_digital_filter/check/src/
read -formal /TVLSI_WORK/Ginisha/testing_file/Modules_Design/few_shot_int8_gemma2_9b/digital_filter.v
read -formal /TVLSI_WORK/Ginisha/testing_file/Modules_FV/few_shot_int8_gemma2_9b/digital_filter_converted.v
prep -top tb_digital_filter

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
