# running in /TVLSI_WORK/Ginisha/testing_file/check/tb_bcd_to_gray/check/src/
read -formal /TVLSI_WORK/Ginisha/testing_file/Modules_Design/few_shot_int8_gemma2_9b/bcd_to_gray_converter.v
read -formal /TVLSI_WORK/Ginisha/testing_file/Modules_FV/few_shot_int8_gemma2_9b/bcd_to_gray_converter_converted.v
prep -top tb_bcd_to_gray

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
