# running in /TVLSI_WORK/Ginisha/testing_file/check/tb_fibonacci_gen/check/src/
read -formal /TVLSI_WORK/Ginisha/testing_file/Modules_Design/few_shot_int8_gemma2_9b/fibonacci_number_generator.v
read -formal /TVLSI_WORK/Ginisha/testing_file/Modules_FV/few_shot_int8_gemma2_9b/fibonacci_number_generator_converted.v
prep -top tb_fibonacci_gen

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
