# running in /TVLSI_WORK/Ginisha/testing_file/check/tb_fsm_1100/check/src/
read -formal /TVLSI_WORK/Ginisha/testing_file/Modules_Design/few_shot_int8_gemma2_9b/fsm_1100_pattern_.v
read -formal /TVLSI_WORK/Ginisha/testing_file/Modules_FV/few_shot_int8_gemma2_9b/fsm_1100_pattern__converted.v
prep -top tb_fsm_1100

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
