# running in /TVLSI_WORK/Ginisha/testing_file/check/tb_uart_module/check/src/
read -formal /TVLSI_WORK/Ginisha/testing_file/Modules_Design/few_shot_int8_gemma2_9b/uart_universal_asynchronous_receiver_transmitter_.v
read -formal /TVLSI_WORK/Ginisha/testing_file/Modules_FV/few_shot_int8_gemma2_9b/uart_universal_asynchronous_receiver_transmitter__converted.v
prep -top tb_uart_module

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
